//VDNI JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=CDCCTDNI
//CEEOPTS DD *
  TEST(,,,DBMDT%B45617:)
/*
//STEPLIB  DD DSN=D.LIB.LOAD.ONLINE.COB630,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
