//B45617CC JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=CDCCCOBC
//CEEOPTS DD *
  TEST(,,,DBMDT%B45617:)
/*
//STEPLIB  DD DSN=D.LIB.LOAD.BATCH.COB630,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
