//B45617FC JOB (B45617),'PROYECTO.FIN.COBOL',CLASS=9,MSGCLASS=A
//RUNCOB   EXEC  PGM=CDCG1FOC
//CEEOPTS DD *
  TEST(,,,DBMDT%B45617:)
/*
//STEPLIB  DD  DSN=D.LIB.LOAD.BATCH.COB630,DISP=SHR
//TXG01    DD DSN=D.CDC.G01.F.INTSORT,DISP=SHR
//TXOUTG1  DD DSN=D.CDC.G01SN.CDC.CDCPG01.CDCCON.CONS.HOSTPC,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(CYL,(10,5)),DCB=(RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
