//CHECKORD JOB (B45617),'CHECK ORDER',CLASS=9,MSGCLASS=A
//STEP1   EXEC PGM=ICETOOL
//TOOLMSG DD SYSOUT=*
//DFSMSG  DD SYSOUT=*
//IN1     DD DSN=D.CDC.G01SN.CDC.CDCPG01.CDCCON.ACUMDIA,DISP=SHR
//IN2     DD DSN=D.CDC.G01.F.ACUMSORT,DISP=SHR
//OUT     DD SYSOUT=*
//TOOLIN   DD *
  COMPARE FROM(IN1) TO(IN2) ON(1,473,CH) LIST OUTOUT(OUT)
/*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//TOOLMSG  DD SYSOUT=*
//DFSMSG   DD SYSOUT=*
