//CALLSAL JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=CDCCSALD,PARM='0001000004|R|0004890000'
//*CEEOPTS   DD *
//*  TEST(,,,DBMDT%B45617:)
//*
//STEPLIB  DD DSN=D.LIB.LOAD.BATCH.COB630,DISP=SHR
//VSAMDS   DD DSN=B45617.CUENTAS.VSAM,DISP=SHR
//MVFILE   DD DSN=B45617.CUENTAS.MOVS,
//            DISP=(MOD,CATLG,CATLG),
//            SPACE=(TRK,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=55,BLKSIZE=0)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
