//B45617LD JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=A
//STEP1    EXEC PGM=CDCCTRLD
//STEPLIB  DD  DSN=D.LIB.LOAD.BATCH.COB630,DISP=SHR
//LDCLIS  DD DSN=B45617.CLI.NOMS,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*

