//CGXY JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=CDCCGXY
//STEPLIB  DD DSN=D.LIB.LOAD.BATCH.COB630,DISP=SHR
//IGXY   DD DSN=B45617.PUNTOS.XY,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
