//COPYMBR   JOB (B45617),'COPY MEMBER',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//INPDS    DD DSN=D.LIB.LOAD.BATCH.COB630,DISP=SHR
//OUTPDS   DD DSN=B45617.COBOL.LOAD.COB360,DISP=SHR
//SYSIN    DD *
  COPY INDD=INPDS,OUTDD=OUTPDS
  SELECT MEMBER=CDCINPLZ
/*
//
