//CREAVSAM JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE CLUSTER ( -
    NAME(B45617.CUENTAS.VSAM) -
    INDEXED -
    RECORDSIZE(40 40) -
    KEYS(10 0) -
    FREESPACE(0 0) -
    REUSE -
    VOLUMES(STG337) -
    CYLINDERS(1 1))
/*
