//CREAJCL JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=IEFBR14
//PDS130   DD  DSN=B45617.SOURCE3,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(1,1,5)),
//             DCB=(RECFM=FB,LRECL=130,BLKSIZE=0,DSORG=PO),
//             UNIT=SYSDA
