//LOADSAL JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO INFILE(INP1) OUTFILE(VSAMDS)
/*
//INP1     DD DSN=B45617.CUENTAS.SALDOS,DISP=SHR
//VSAMDS   DD DSN=B45617.CUENTAS.VSAM,DISP=SHR
