//SMSALDO JOB (B45617),'MIGUEL.ANGEL.CHAVEZ',CLASS=9,MSGCLASS=S
//STEP1 EXEC PGM=SORT
//SORTIN DD DSN=B45617.OW.SOURCE(SALDO1),DISP=SHR
// DD DSN=B45617.OW.SOURCE(SALDO2),DISP=SHR
// DD DSN=B45617.OW.SOURCE(SALDO3),DISP=SHR
//SORTOUT DD DSN=B45617.OW.NEW,DISP=(NEW,CATLG,DELETE),
// SPACE=(CYL,(5,2)),UNIT=SYSDA,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSIN DD *
 SORT FIELDS=(1,20,CH,A)
 SUM FIELDS=(53,10,ZD)
/*
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*