//VCSALD   JOB (B45617),'VER VSAM',CLASS=9,MSGCLASS=H
//STEP1    EXEC PGM=IDCAMS
//VSAMDS   DD  DSN=B45617.CUENTAS.VSAM,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
  PRINT INFILE(VSAMDS) CHAR
/*

